[
  {
    "title": "Mario Strikers: Battle League post-launch updates confirmed, including new characters",
    "author": "Nintendo",
    "content": "Nintendo has confirmed that Mario Strikers: Battle League will be receiving new updates after launch. As part of this, fans can look forward to additional characters. Specifics havent been shared just yet though, but we know that the updates will be entirely free. Providing updates after release is a familiar move for Nintendo, especially when it comes to sports games on Switch. With Mario Tennis Aces for example, the game added Koopa Troopa, Blooper, Diddy Kong, Birdo, Shy Guy, Petey Piranha, Luma, Boom Boom, Pauline, Kamek, Dry Bones, Fire Piranha Plant, and Dry Bowser after launch. Meanwhile, we saw Toadette, Ninji, Koopa Troopa, Wiggler, and Shy Guy in Mario Golf: Super Rush after release. Fans have been pretty vocal about the roster in Mario Strikers: Battle League, including their desire to see characters such as Daisy. With the updates coming after the game’s debut, these wishes will be fulfilled.",
    "dateCreated": "2022-05-05T16:55:12.725Z"
  },
  {
    "title": "A closer look at the chaotic, compelling gameplay of SpiderHeck",
    "author": "PlayStation",
    "content": "Hello, Heckstars! It’s Sergey from tinyBuild here, and today I’m incredibly excited to tell you more about our upcoming fast-paced, physics-based, couch multiplayer brawler SpiderHeck. So, how can I describe SpiderHeck to you? In all honesty, it’s so epic, it’s unexplainable. You need to play it for yourself to get where I’m coming from. Because if you put seven-legged spiders (does it make them spiders in this case?), particle blades, laser blasters, rocket launchers, lots of enemies and your friends together, and top that with the physic-based environments and battle mechanics, mind blowing web slinging parkour moves and close calls – that sounds like a crazy hectic game. But its the chaos that makes SpiderHeck so much fun! As the saying goes – a picture is worth a thousand words, so check out the new gameplay trailer below.",
    "dateCreated": "2022-08-02T16:55:12.725Z"
  },
  {
    "title": "Determine the Destiny of Golden Sands Outpost in Sea of Thieves’ New Adventure Lost Sands",
    "author": "Xbox",
    "content": "The fate of Golden Sands Outpost hangs in the balance in Sea of Thieves’ fourth time-limited Adventure, Lost Sands. In a departure from previous Adventures, players can pick the path they wish to follow, either choosing to aid in the Outpost’s reconstruction or dooming it to be ever shrouded in ethereal mist. The side with the most support at the end of the Adventure will determine the future of Golden Sands in Sea of Thieves, so weigh your options carefully! Do you want the Outpost restored to its previous prominence, or would you rather leave it in ruins as a tactical play or a testament to Captain Flameheart’s power? As with previous Adventures, players have been given a glimpse of the current state of play in the cinematic opening trailer.",
    "dateCreated": "2022-01-01T16:55:12.725Z"
  }
]